Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: Called to delete the attribute on an instance *instance* of the owner class.
ru: Вызывается для удаления “данного атрибута” в экземпляре *instance* “класса-владельца” .

source: Invoking Descriptors
ru: Вызов дескрипторов

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the base classes of ``type(a)`` excluding metaclasses.
ru: Обычно эффект доступа к атрибутам заключается в чтении, записи или удалении их из словаря объекта. Например, поиск «``a.x``» происходит в такой последовательности : «``a.__dict__['x']``» , затем «``type(a).__dict__['x']``» и далее в базовых классах класса «``type(a)``» , исключая метаклассы.

source: However, if the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined and how they were called.
ru: Но, если значением искомого атрибута является объект, в котором определён один из дескрипторных методов, то Питон может обойти обычное поведение и вызвать вместо этого дескрипторный метод. На каком этапе последовательности поиска атрибута это произойдёт – зависит от того, какие дескрипторные методы были определены, и как они были вызваны.

source: If binding to an object instance, ``a.x`` is transformed into the call: ``type(a).__dict__['x'].__get__(a, type(a))``.
ru: При вызове через объект-экземпляр *a* : «``a.x``» преобразуется в вызов «``type(a).__dict__['x'].__get__(a, type(a))``» .

source: If binding to a class, ``A.x`` is transformed into the call: ``A.__dict__['x'].__get__(None, A)``.
ru: При вызове через класс *A* : «``A.x``» преобразуется в вызов «``A.__dict__['x'].__get__(None, A)``» .

source: By default, instances of classes have a dictionary for attribute storage. This wastes space for objects having very few instance variables. The space consumption can become acute when creating large numbers of instances.
ru: По умолчанию экземпляры классов имеют словарь для хранения атрибутов. Это расходует много места для объектов, имеющих мало своих переменных. Расход места может стать острым, при создании большого количества экземпляров.

source: The default can be overridden by defining *__slots__* in a class definition. The *__slots__* declaration takes a sequence of instance variables and reserves just enough space in each instance to hold a value for each variable. Space is saved because *__dict__* is not created for each instance.
ru: Это стандартное поведение можно отменить, определив «:attr:`__slots__`» в определении класса. «:attr:`__slots__`» получает последовательность переменных экземпляра и резервирует в каждом экземпляре только необходимое для хранения значений всех его переменных количество места. Место экономится, поскольку не создаётся «:attr:`__dict__`» для каждого экземпляра.

source: This class variable can be assigned a string, iterable, or sequence of strings with variable names used by instances. If defined in a class, *__slots__* reserves space for the declared variables and prevents the automatic creation of *__dict__* and *__weakref__* for each instance.
ru: Этой переменной класса можно назначить строку, итерируемый объект или последовательность строк с именами переменных, используемых экземплярами. В случае объявления его в классе, «:attr:`__slots__`» резервирует место для объявленных переменных и отменяет автоматическое создание «:attr:`__dict__`» и «:attr:`__weakref__`» для каждого экземпляра.

source: Notes on using *__slots__*
ru: Замечания по использованию «:attr:`__slots__`»

source: When inheriting from a class without *__slots__*, the *__dict__* attribute of that class will always be accessible, so a *__slots__* definition in the subclass is meaningless.
ru: При наследовании от класса без «:attr:`__slots__`» , атрибут «:attr:`__dict__`» этого класса будет всегда доступным, поэтому определение «:attr:`__slots__`» в подклассах бесполезно.

source: Without a *__dict__* variable, instances cannot be assigned new variables not listed in the *__slots__* definition. Attempts to assign to an unlisted variable name raises :exc:`AttributeError`. If dynamic assignment of new variables is desired, then add ``'__dict__'`` to the sequence of strings in the *__slots__* declaration.
ru: Без переменной «:attr:`__dict__`» экземплярам не могут быть назначены новые переменные, не перечисленные в определении «:attr:`__slots__`» . Попытки назначений не перечисленных имен переменных вызывают ошибку «:exc:`AttributeError`» . Если желательно динамическое назначение новых переменных, добавьте ``'__dict__'`` в последовательность строк в определении «:attr:`__slots__`» .

source: Without a *__weakref__* variable for each instance, classes defining *__slots__* do not support weak references to its instances. If weak reference support is needed, then add ``'__weakref__'`` to the sequence of strings in the *__slots__* declaration.
ru: Без переменной «:attr:`__weakref__`» у каждого экземпляра – классы, в которых определён «:attr:`__slots__`» – не поддерживают «слабые» ссылки на свои экземпляры. Если поддержка слабых ссылок нужна, то к последовательности строк в объявлении «:attr:`__slots__`» добавьте «``'__weakref__'``» .

source: *__slots__* are implemented at the class level by creating descriptors (:ref:`descriptors`) for each variable name. As a result, class attributes cannot be used to set default values for instance variables defined by *__slots__*; otherwise, the class attribute would overwrite the descriptor assignment.
ru: «:attr:`__slots__`» реализованы на уровне соответствующего класса посредством создания дескрипторов (смотрите “Реализация дескрипторов” :ref:`descriptors` ) для каждого имени переменной. В результате атрибуты класса не могут быть использованы для установки значений по-умолчанию для переменных у экземпляров, определённых посредством «:attr:`__slots__`» – иначе атрибуты этих классов могли бы переписать назначение этих дескрипторов.

source: The action of a *__slots__* declaration is limited to the class where it is defined. As a result, subclasses will have a *__dict__* unless they also define *__slots__* (which must only contain names of any *additional* slots).
ru: Эффект объявления «:attr:`__slots__`» распространяется только на тот класс, в котором этот атрибут определён. Таким образом : подклассы будут иметь атрибут «:attr:`__dict__`» , если сами также не определят «:attr:`__slots__`» (который должен содержать имена только дополнительных “слотов” ) .

source: If a class defines a slot also defined in a base class, the instance variable defined by the base class slot is inaccessible (except by retrieving its descriptor directly from the base class). This renders the meaning of the program undefined. In the future, a check may be added to prevent this.
ru: Если класс определяет “слот” , который определён и в базовом классе, то та переменная экземпляра, которая определена “слотом” базового класса, будет недоступна (за исключением явного получения дескриптора через базовый класс) . Это делает неопределённым значение программы. В будущем для предотвращения этого может быть добавлена какая-либо проверка.

source: Nonempty *__slots__* does not work for classes derived from "variable-length" built-in types such as :class:`int`, :class:`str` and :class:`tuple`.
ru: Непустой атрибут «:attr:`__slots__`» не действует для классов, произведённых от встроенных типов “переменной длинны” , таких как :class:`int` , :class:`str` и :class:`tuple` .

source: Any non-string iterable may be assigned to *__slots__*. Mappings may also be used; however, in the future, special meaning may be assigned to the values corresponding to each key.
ru: Любой перебираемый (“итерируемый”) объект, кроме текста – может быть назначен атрибуту «:attr:`__slots__`» . Отображения тоже могут быть использованы, однако, в будущем им может быть придан специальный смысл.

source: *__class__* assignment works only if both classes have the same *__slots__*.
ru: Назначение атрибуту «:attr:`__class__`» работает, только если оба класса имеют один и тот же «:attr:`__slots__`» .

source: Customizing class creation
ru: Управление созданием классов

source: By default, classes are constructed using :func:`type`. A class definition is read into a separate namespace and the value of class name is bound to the result of ``type(name, bases, dict)``.
ru: По умолчанию классы создаются с использованием «:func:`type`» . Определение класса “считывается” в отдельное пространство имён, и получившемуся результату ``type(name, bases, dict)`` назначается соответствующее имя класса.

source: When the class definition is read, if a callable ``metaclass`` keyword argument is passed after the bases in the class definition, the callable given will be called instead of :func:`type`. If other keyword arguments are passed, they will also be passed to the metaclass. This allows classes or functions to be written which monitor or alter the class creation process:
ru: Когда описание данного класса считывается, если передан исполнимый аргумент под ключевым словом «:keyword:`metaclass`» после базовых классов в определении класса, то этот исполнимый объект будет вызван вместо «:func:`type`» . Если переданы и другие именованные аргументы, то они также будут переданы этому метаклассу. Это позволяет писать классы или функции, которые отслеживают или изменяют процесс создания класса :

source: Modifying the class dictionary prior to the class being created.
ru: Модифицируя словарь данного класса перед тем, как данный класс будет создан.

source: Returning an instance of another class -- essentially performing the role of a factory function.
ru: Возвращая экземпляр другого класса, по сути исполняя роль функций-фабрик.

source: These steps will have to be performed in the metaclass's :meth:`__new__` method -- :meth:`type.__new__` can then be called from this method to create a class with different properties. This example adds a new element to the class dictionary before creating the class::
ru: Эти шаги должны быть исполнены в методе «:meth:`__new__`» данного метакласса – затем из этого метода может быть вызван «:meth:`type.__new__`» для создания класса с другими свойствами. Следующий пример добавляет новый элемент к словарю данного класса перед созданием данного класса :

source: You can of course also override other class methods (or add new methods); for example defining a custom :meth:`__call__` method in the metaclass allows custom behavior when the class is called, e.g. not always creating a new instance.
ru: Конечно, вы можете ещё и переопределять другие методы класса (или добавлять новые) . Например, определение метода «:meth:`__call__`» позволяет настроить то, как ведёт себя данный класс при вызове, например, чтобы он не каждый раз создавал новый экземпляр.

source: If the metaclass has a :meth:`__prepare__` attribute (usually implemented as a class or static method), it is called before the class body is evaluated with the name of the class and a tuple of its bases for arguments. It should return an object that supports the mapping interface that will be used to store the namespace of the class. The default is a plain dictionary. This could be used, for example, to keep track of the order that class attributes are declared in by returning an ordered dictionary.
ru: Если у данного класса есть атрибут «:meth:`__prepare__`» (обычно реализованный как класс или статический метод) , то он вызывается с именем данного класса и с кортежем его базовых классов в качестве аргументов – до исполнения (интерпретации) “тела” данного класса. Результатом должен быть объект, поддерживающий интерфейс отображения, который будет содержать область имён данного класса. По-умолчанию – это простой словарь. Это может использоваться, например, для запоминания (в возвращаемом упорядоченном словаре) того порядка, в котором атрибуты данного класса были объявлены.

source: The appropriate metaclass is determined by the following precedence rules:
ru: Соответствующий метакласс определяется следующей последовательностью правил :

source: If the ``metaclass`` keyword argument is passed with the bases, it is used.
ru: Если аргумент под именем «``metaclass``» передан с базовыми классами, то используется он.

source: Otherwise, if there is at least one base class, its metaclass is used.
ru: Иначе, если есть хотя бы один базовый класс, то используются его метаклассы.

source: Otherwise, the default metaclass (:class:`type`) is used.
ru: Иначе – используется метакласс по умолчанию («:class:`type`») .

source: The potential uses for metaclasses are boundless. Some ideas that have been explored including logging, interface checking, automatic delegation, automatic property creation, proxies, frameworks, and automatic resource locking/synchronization.
ru: Возможные применения для метаклассов неограничены. Наиболее разработаны следующие : логирование, проверка интерфейса, автоматическое делегирование, автоматическое создание свойств, посредники, среды исполнения, и т. д. .

source: Here is an example of a metaclass that uses an :class:`collections.OrderedDict` to remember the order that class members were defined::
ru: Далее дан пример метакласса, использующего «:class:`collections.OrderedDict`» для запоминания порядка, в котором члены класса были определены : ::

source: When the class definition for *A* gets executed, the process begins with calling the metaclass's :meth:`__prepare__` method which returns an empty :class:`collections.OrderedDict`. That mapping records the methods and attributes of *A* as they are defined within the body of the class statement. Once those definitions are executed, the ordered dictionary is fully populated and the metaclass's :meth:`__new__` method gets invoked. That method builds the new type and it saves the ordered dictionary keys in an attribute called *members*.
ru: Когда происходит переход к исполнению определения класса *A* , то этот процесс начинается с вызова из метакласса метода «:meth:`__prepare__`» , который возвращает пустой объект «:class:`collections.OrderedDict`» . Это отображение записывает методы и атрибуты класса *A* , как если бы они были определены внутри тела этого класса. Когда эти определения исполнены – данный упорядоченый словарь полностью заполняется, и метод «:meth:`__new__`» метакласса вызывается. И последний создаёт новый тип и сохраняет ключи упорядоченого словаря в атрибуте «``members``» .

source: Emulating callable objects
ru: Эмулирование исполнимых объектов

source: Called when the instance is "called" as a function; if this method is defined, ``x(arg1, arg2, ...)`` is a shorthand for ``x.__call__(arg1, arg2, ...)``.
ru: Вызывается, когда данный экземпляр вызывается как функция, если этот метод определён. «``x(arg1, arg2, ...)``» является краткой формой для «``x.__call__(arg1, arg2, ...)``» .

source: Emulating container types
ru: Эмулирование контейнерных типов

source: The following methods can be defined to implement container objects. Containers usually are sequences (such as lists or tuples) or mappings (like dictionaries), but can represent other containers as well. The first set of methods is used either to emulate a sequence or to emulate a mapping; the difference is that for a sequence, the allowable keys should be the integers *k* for which ``0 <= k < N`` where *N* is the length of the sequence, or slice objects, which define a range of items. It is also recommended that mappings provide the methods :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`get`, :meth:`clear`, :meth:`setdefault`, :meth:`pop`, :meth:`popitem`, :meth:`copy`, and :meth:`update` behaving similar to those for Python's standard dictionary objects. The :mod:`collections` module provides a :class:`MutableMapping` abstract base class to help create those methods from a base set of :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__`, and :meth:`keys`. Mutable sequences should provide methods :meth:`append`, :meth:`count`, :meth:`index`, :meth:`extend`, :meth:`insert`, :meth:`pop`, :meth:`remove`, :meth:`reverse` and :meth:`sort`, like Python standard list objects. Finally, sequence types should implement addition (meaning concatenation) and multiplication (meaning repetition) by defining the methods :meth:`__add__`, :meth:`__radd__`, :meth:`__iadd__`, :meth:`__mul__`, :meth:`__rmul__` and :meth:`__imul__` described below; they should not define other numerical operators. It is recommended that both mappings and sequences implement the :meth:`__contains__` method to allow efficient use of the ``in`` operator; for mappings, ``in`` should search the mapping's keys; for sequences, it should search through the values. It is further recommended that both mappings and sequences implement the :meth:`__iter__` method to allow efficient iteration through the container; for mappings, :meth:`__iter__` should be the same as :meth:`keys`; for sequences, it should iterate through the values.
ru: Следующие методы могут быть определены для реализации объектов-контейнеров. Контейнеры – это обычно последовательности (как списки или кортежи) или отображения (как словари) , но также могут быть реализованы другие виды. Первая группа следующих далее методов используется для эмуляции как последовательностей, так и отображений – разница в том, что для последовательностей допустимые ключи должны быть целым числом *k* в диапазоне «0 <= k < N» , где *N* равно длине данной последовательности, или быть объектом-срезом (который определяет диапазон элементов) . Также рекомендуется, чтобы отображения предоставляли методы : «:meth:`keys`» , «:meth:`values`» , «:meth:`items`» , «:meth:`get`» , «:meth:`clear`» , «:meth:`setdefault`» , «:meth:`pop`» , «:meth:`popitem`» , «:meth:`copy`» и «:meth:`update`» , дающие тот же эффект, что и в стандартных Питоновских словарях. Модуль «:mod:`collections`» предоставляет абстрактный базовый класс «:class:`MutableMapping`» , облегчающий создание этих методов на основе базового набора из : «:meth:`__getitem__`» , «:meth:`__setitem__`» , «:meth:`__delitem__`» и «:meth:`keys`» . Изменяемые последовательности могут предоставлять методы : «:meth:`append`» , «:meth:`count`» , «:meth:`index`» , «:meth:`extend`» , «:meth:`insert`» , «:meth:`pop`» , «:meth:`remove`» , «:meth:`reverse`» и «:meth:`sort`» – как у обычных Питоновских списков. И, наконец, типы-последовательности могут реализовать сложение (тоесть конкатенацию) и умножение (тоесть повтор) – через определение методов : «:meth:`__add__`» , «:meth:`__radd__`» , «:meth:`__iadd__`» , «:meth:`__mul__`» , «:meth:`__rmul__`» и «:meth:`__imul__`» (их описание – ниже) – эти типы не должны определять другие числовые операции. Рекомендуется и в отображениях и в последовательностях обеспечивать метод «:meth:`__contains__`» , который был бы эффективной реализацией оператора «:keyword:`in`» . Для отображений – «:keyword:`in`» должен искать в ключах этого отображения, а для последовательностей – в значениях. Кроме того, рекомендуется для отображений и последовательностей реализовывать метод «:meth:`__iter__`» для эффективного перебора элементов в этом контейнере. Для отображений – «:meth:`__iter__`» должен быть то же, что и «:meth:`keys`» , а для последовательностей этот метод должен перебирать значения.

source: Called to implement the built-in function :func:`len`. Should return the length of the object, an integer ``>=`` 0. Also, an object that doesn't define a :meth:`__bool__` method and whose :meth:`__len__` method returns zero is considered to be false in a Boolean context.
ru: Вызывается для реализации встроенной функции «:func:`len`» . Этот метод должен возвращать длину данного объекта в виде целого значения >= 0 . Кроме этого, объект, в котором не определён метод «:meth:`__bool__`» и чей метод «:meth:`__len__`» возвращает ноль – считается ложью в контексте булевых операций.

source: Slicing is done exclusively with the following three methods. A call like ::
ru: Срезы производятся исключительно следующими тремя методами. Вызов вроде : ::

source: is translated to ::
ru: преобразуется в : ::

source: and so forth. Missing slice items are always filled in with ``None``.
ru: и так далее. Отсутствующие параметры среза всегда заполняются значениями «:const:`None`» .

source: Called to implement evaluation of ``self[key]``. For sequence types, the accepted keys should be integers and slice objects. Note that the special interpretation of negative indexes (if the class wishes to emulate a sequence type) is up to the :meth:`__getitem__` method. If *key* is of an inappropriate type, :exc:`TypeError` may be raised; if of a value outside the set of indexes for the sequence (after any special interpretation of negative values), :exc:`IndexError` should be raised. For mapping types, if *key* is missing (not in the container), :exc:`KeyError` should be raised.
ru: Вызывается для реализации вычисления (получения) ``self[key]`` . Для типов-последовательностей – допустимые ключи должны быть целыми числами или специальными объектами-срезами. Заметьте, что особая интерпретация негативных индексов (если данный класс желает эмулировать тип-последовательность) распространяется и на метод «:meth:`__getitem__`» . Если *key* не подходящего типа, то может инициироваться «:exc:`TypeError`» , а если значение за пределами набора индексов данной последовательности (вследствие какой-либо оригинальной интерпретации негативных значений) – то должно инициироваться «:exc:`IndexError`» . Для отображающих типов, если *key* отсутствует (не в контейнере) – должно инициироваться «:exc:`KeyError`» .

source: :keyword:`for` loops expect that an :exc:`IndexError` will be raised for illegal indexes to allow proper detection of the end of the sequence.
ru: циклы «:keyword:`for`» ожидают, что для недопустимых индексов будет инициировано «:exc:`IndexError`» , что нужно для правильного определения конца последовательности.

source: Called to implement assignment to ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support changes to the values for keys, or if new keys can be added, or for sequences if elements can be replaced. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
ru: Вызывается для реализации назначения для ``self[key]`` . То же замечание об отрицательных индексах, что и для «:meth:`__getitem__`» . Этот метод должен быть реализован для отображений – только если эти объекты поддерживают изменение значений ключей, или если могут добавляться новые ключи, или для последовательностей, если элементы могут быть заменены. Для неправильных значений *key* исключения должны инициироваться также, как и для «:meth:`__getitem__`» .

source: Called to implement deletion of ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support removal of keys, or for sequences if elements can be removed from the sequence. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
ru: Вызывается для реализации удаления ``self[key]`` . То же замечание об отрицательных индексах, что и для «:meth:`__getitem__`» . Этот метод должен быть реализован для отображений – только если эти объекты поддерживают удаление ключей, или для последовательностей, если элементы могут быть удалены из этой последовательности. Для неправильных значений *key* исключения должны инициироваться также, как и для «:meth:`__getitem__`» .
